Catalogs/НаборыДополнительныхРеквизитовИСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НаборыДополнительныхРеквизитовИСведений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоНабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УправлениеСвойствамиПотолки/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. УправлениеСвойствамиПереопределяемый.ЗаполнитьНаборыСвойствОбъекта
Процедура ЗаполнитьНаборыСвойствОбъекта(Знач Объект, ТипСсылки, НаборыСвойств, СтандартнаяОбработка, КлючНазначения) Экспорт
	
	Если ТипСсылки = Тип("СправочникСсылка.Номенклатура") И НЕ Объект.ЭтоГруппа Тогда
		ЗаполнитьНаборСвойствПоКатегорииНоменклатуры(Объект, ТипСсылки, НаборыСвойств);
				
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.Контрагенты") И НЕ Объект.ЭтоГруппа Тогда
		ЗаполнитьНаборСвойствПоКатегорииКонтрагента(Объект, ТипСсылки, НаборыСвойств);
		
	КонецЕсли;
		
КонецПроцедуры

// Заполнить набор свойств номенклатуры по категории
// 
// Параметры:
// 	Объект - Произвольный
// 	ТипСсылки - Тип
// 	НаборыСвойств - см. УправлениеСвойствамиПереопределяемый.ЗаполнитьНаборыСвойствОбъекта.НаборыСвойств
Процедура ЗаполнитьНаборСвойствПоКатегорииНоменклатуры(Объект, ТипСсылки, НаборыСвойств) Экспорт

	Строка = НаборыСвойств.Добавить();
	Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура_Общие");
	Строка.Заголовок = "Общие свойства";
	
	//Если ТипЗнч(Объект) = ТипСсылки Тогда
	//	Номенклатура = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект, "ЭтоГруппа, Категория");
	//Иначе
	//	Номенклатура = Объект;
	//КонецЕсли;

	//Если Номенклатура.ЭтоГруппа = Ложь Тогда

		Строка = НаборыСвойств.Добавить();
		//Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура.Категория, "НаборСвойств");
		Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Категория, "НаборСвойств");
		Строка.Заголовок = "Свойства для категории номенклатуры";
	//КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьНаборСвойствПоКатегорииКонтрагента(Объект, ТипСсылки, НаборыСвойств)
	
	Строка = НаборыСвойств.Добавить();
	Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Контрагенты_Общие");
	Строка.Заголовок = "Общие свойства";
	
	//Если ТипЗнч(Объект) = ТипСсылки Тогда
	//    Контрагент = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "ЭтоГруппа, Категория");
	//Иначе
	//	Контрагент = Объект;
	//КонецЕсли;
	//
	//Если Контрагент.ЭтоГруппа = Ложь Тогда
        Строка = НаборыСвойств.Добавить();
        //Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент.Категория, "НаборСвойств");
		Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Категория, "НаборСвойств");
		Строка.Заголовок = "Свойства для категории контрагента";
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ПеренестиДопРеквизитыПриОбновленииБСП_3_1_1_151() Экспорт
	
	Выборка = Справочники.КатегорияНоменклатуры.Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		УправлениеСвойствами.ПередЗаписьюВидаОбъекта(СпрОбъект, "Справочник_Номенклатура");
	КонецЦикла;
	
	Выборка = Справочники.КатегорииКонтрагентов.Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		УправлениеСвойствами.ПередЗаписьюВидаОбъекта(СпрОбъект, "Справочник_Контрагенты");
	КонецЦикла;	
	
	// номенклатура
	СпрИсточник = НаборПоИмени("Номенклатура", Истина, Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка());
	Если ЗначениеЗаполнено(СпрИсточник) Тогда
		СпрПриемникСсылка = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура");	
		ПеренестиДопРеквизитыОбъектов(СпрИсточник, СпрПриемникСсылка);
		
		СпрИсточник1 = НаборПоИмени("Общие", Ложь, СпрИсточник);
		Если ЗначениеЗаполнено(СпрИсточник) Тогда
			СпрПриемникСсылка = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура_Общие");	
			ПеренестиДопРеквизитыОбъектов(СпрИсточник1, СпрПриемникСсылка);
		КонецЕсли;
		
		// категории номенклатуры - надо?
		
	КонецЕсли;
	
	// контрагенты
	СпрИсточник = НаборПоИмени("Контрагенты", Истина, Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка());
	Если ЗначениеЗаполнено(СпрИсточник) Тогда
		СпрПриемникСсылка = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Контрагенты");	
		ПеренестиДопРеквизитыОбъектов(СпрИсточник, СпрПриемникСсылка);
		
		СпрИсточник1 = НаборПоИмени("Общие", Ложь, СпрИсточник);
		Если ЗначениеЗаполнено(СпрИсточник) Тогда
			СпрПриемникСсылка = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Контрагенты_Общие");	
			ПеренестиДопРеквизитыОбъектов(СпрИсточник1, СпрПриемникСсылка);
		КонецЕсли;
		
		// категории контрагентов - надо?
		
	КонецЕсли;	
	
	// монтажи
	СпрИсточник = НаборПоИмени("Монтажи", Ложь, Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка());
	Если ЗначениеЗаполнено(СпрИсточник) Тогда
		СпрПриемникСсылка = УправлениеСвойствами.НаборСвойствПоИмени("Документ_Монтаж");	
		ПеренестиДопРеквизитыОбъектов(СпрИсточник, СпрПриемникСсылка);		
	КонецЕсли;
	
	// лиды
	СпрИсточник = НаборПоИмени("Лиды", Ложь, Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка());
	Если ЗначениеЗаполнено(СпрИсточник) Тогда
		СпрПриемникСсылка = УправлениеСвойствами.НаборСвойствПоИмени("Документ_Лид");	
		ПеренестиДопРеквизитыОбъектов(СпрИсточник, СпрПриемникСсылка);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НаборПоИмени(Наименование, ЭтоГруппа, Родитель)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("ЭтоГруппа", ЭтоГруппа);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
	|ГДЕ
	|	НаборыДополнительныхРеквизитовИСведений.Наименование = &Наименование
	|	И НаборыДополнительныхРеквизитовИСведений.ЭтоГруппа = &ЭтоГруппа
	|	И НаборыДополнительныхРеквизитовИСведений.Родитель = &Родитель
	|	И НаборыДополнительныхРеквизитовИСведений.ИмяПредопределенногоНабора = """"
	|	И НаборыДополнительныхРеквизитовИСведений.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Процедура ПеренестиДопРеквизитыОбъектов(СпрИсточник, СпрПриемникСсылка)
	
	СпрПриемник = СпрПриемникСсылка.ПолучитьОбъект();
	
	Для каждого СтрокаТЗ из СпрИсточник.ДополнительныеРеквизиты Цикл
		СтрокаД = СпрПриемник.ДополнительныеРеквизиты.Найти(СтрокаТЗ.Свойство, "Свойство");
		Если СтрокаД = Неопределено Тогда
			НоваяСтрока = СпрПриемник.ДополнительныеРеквизиты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			НоваяСтрока.ИмяПредопределенногоНабора = СпрПриемник.ИмяПредопределенногоНабора;
		КонецЕсли;
	КонецЦикла;
	
	СпрПриемник.Записать();
	
КонецПроцедуры

#КонецОбласти
